{
    "architectures": [
        "KimiLinearForCausalLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_kimi.KimiLinearConfig",
        "AutoModel": "modeling_kimi.KimiLinearModel",
        "AutoModelForCausalLM": "modeling_kimi.KimiLinearForCausalLM"
    },
    "bos_token_id": 163584,
    "dtype": "bfloat16",
    "eos_token_id": 163586,
    "first_k_dense_replace": 1,
    "head_dim": 72,
    "hidden_act": "silu",
    "hidden_size": 2304,
    "initializer_range": 0.02,
    "intermediate_size": 9216,
    "kv_lora_rank": 512,
    "linear_attn_config": {
        "full_attn_layers": [
            4,
            8,
            12,
            16,
            20,
            24,
            27
        ],
        "head_dim": 128,
        "kda_layers": [
            1,
            2,
            3,
            5,
            6,
            7,
            9,
            10,
            11,
            13,
            14,
            15,
            17,
            18,
            19,
            21,
            22,
            23,
            25,
            26
        ],
        "num_heads": 32,
        "short_conv_kernel_size": 4
    },
    "mla_use_nope": true,
    "model_max_length": 1048576,
    "model_type": "kimi_linear",
    "moe_intermediate_size": 1024,
    "moe_layer_freq": 1,
    "moe_renormalize": true,
    "moe_router_activation_func": "sigmoid",
    "num_attention_heads": 32,
    "num_expert_group": 1,
    "num_experts": 256,
    "num_experts_per_token": 8,
    "num_hidden_layers": 27,
    "num_key_value_heads": 32,
    "num_nextn_predict_layers": 0,
    "num_shared_experts": 1,
    "pad_token_id": 163839,
    "q_lora_rank": null,
    "qk_nope_head_dim": 128,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "routed_scaling_factor": 2.446,
    "tie_word_embeddings": false,
    "topk_group": 1,
    "transformers_version": "4.57.0",
    "use_cache": true,
    "use_grouped_topk": true,
    "v_head_dim": 128,
    "vocab_size": 163840
}